---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedTopflangewidth
source: html/bbe50232-d0a8-49ff-1201-4d9c5126c45c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedTopflangewidth Property

"Top Flange Width"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionIweldedTopflangewidth { get; }
```